In [42]:
import pandas as pd
df = pd.DataFrame({
    'name':['Маша', 'Вася', 'Гоша'],
    'age':[25, 8, 48],
    'job':['Программист', 'Школьник', 'Big Molokosos'],
    'salary':[100, 10, 200]
}, index=['some', 'random', 'words']) # добавление текстового индекса вместо числовового

In [43]:
df

        name  age            job  salary
some    Маша   25    Программист     100
random  Вася    8       Школьник      10
words   Гоша   48  Big Molokosos     200

In [44]:
name = df['name']

In [45]:
name

some      Маша
random    Вася
words     Гоша
Name: name, dtype: object

In [46]:
df[df['salary'] >= 100] #пример сортировки

       name  age            job  salary
some   Маша   25    Программист     100
words  Гоша   48  Big Molokosos     200

In [47]:
df['salary'] *=3

In [48]:
df

        name  age            job  salary
some    Маша   25    Программист     300
random  Вася    8       Школьник      30
words   Гоша   48  Big Molokosos     600

In [49]:
df['salary'] / 2

some      150.0
random     15.0
words     300.0
Name: salary, dtype: float64

In [50]:
df

        name  age            job  salary
some    Маша   25    Программист     300
random  Вася    8       Школьник      30
words   Гоша   48  Big Molokosos     600

In [51]:
df['salary'] /= 2

In [52]:
df

        name  age            job  salary
some    Маша   25    Программист   150.0
random  Вася    8       Школьник    15.0
words   Гоша   48  Big Molokosos   300.0

In [53]:
df.loc['some':'words'] # срез по названию индекса

        name  age            job  salary
some    Маша   25    Программист   150.0
random  Вася    8       Школьник    15.0
words   Гоша   48  Big Molokosos   300.0

In [55]:
df.iloc[1]  #возвращение строки как серии

name          Вася
age              8
job       Школьник
salary        15.0
Name: random, dtype: object

In [56]:
# транспонирование
df.T

               some    random          words
name           Маша      Вася           Гоша
age              25         8             48
job     Программист  Школьник  Big Molokosos
salary        150.0      15.0          300.0